app/Controllers/Api/Agama.php

SELECT *
FROM `agamas`
ORDER BY `id` DESC
 LIMIT 10
---
    public function getData($limit, $offset)
    {
        $data = [
            'agama' => $this->model->orderBy('id', 'DESC')->findAll($limit, $offset)
        ];

SELECT *
FROM `agamas`
WHERE `agama` LIKE '%i%'
---
    public function pageSrchData($key, $limit)
    {
        $where = "agama LIKE '%$key%'";
        $totalData = count($this->model->where($where)->findAll());

SELECT *
FROM `agamas`
WHERE `agama` LIKE '%isl%'
ORDER BY `id` DESC
 LIMIT 10
---
    public function srchData($key, $limit, $offset)
    {
        $where = "agama LIKE '%$key%'";
        $data = [
            'agama' => $this->model->orderBy('id', 'DESC')->where($where)->findAll($limit, $offset)
        ];