app/Controllers/Api/KelompokMasyarakat.php

    public function getData($limit, $offset)
    {
        $data = [
            'kelompok_masyarakat' => $this->model->orderBy('id', 'DESC')->findAll($limit, $offset)
        ];
---
SELECT *
FROM `kelompok_masyarakats`
ORDER BY `id` DESC
 LIMIT 10